InformationRegisters/КлассыУсловийТрудаПоДолжностям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлассыУсловийТрудаПоДолжностям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыявленыВредныеОпасныеФакторы</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезультатыСпецоценкиУсловийТруда</v8:Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/КлассыУсловийТруда/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Регистрирует обработчики обновления информационной базы.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - таблица обработчиков обновления.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.32";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d4e5f6a7-b8c9-0123-def0-456789abcde2");
	Обработчик.Процедура = "РегистрыСведений.КлассыУсловийТрудаПоДолжностям.ЗаполнитьВыявленныеВредныеФакторыСОУТ";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение признака выявления вредных факторов СОУТ в записях классов условий труда по должностям и в документах штатного расписания.'");

КонецПроцедуры

// Устанавливает условное оформление запрета редактирования флага
// ВыявленыВредныеОпасныеФакторы для классов, где флаг недоступен для ручного редактирования.
//
// Параметры:
//  УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - условное оформление формы.
//  ИмяПоляКласса - Строка - путь к полю класса условий труда.
//  ИмяПоляФлага - Строка - путь к полю флага ВыявленыВредныеОпасныеФакторы.
//
Процедура УстановитьУсловноеОформлениеФлагаВредныхФакторов(УсловноеОформление, ИмяПоляКласса, ИмяПоляФлага) Экспорт

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	СписокКлассов = Новый СписокЗначений;
	СписокКлассов.ЗагрузитьЗначения(КлассыУсловийТрудаКлиентСервер.КлассыУсловийТрудаДляБлокировкиФлагаВредныхФакторов());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, ИмяПоляКласса, СписокКлассов, ВидСравненияКомпоновкиДанных.ВСписке);

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляФлага);

КонецПроцедуры

// Вызывается при автозаполнении регламентированного отчета.
// Заполняет показатель П000020000400 - количество работающих во вредных и опасных условиях труда.
//
// Параметры:
//  ИДОтчета - Строка
//  ИДРедакцииОтчета - Строка
//  ПараметрыОтчета - Структура
//  Контейнер - Структура
//
Процедура ПриЗаполненииРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт

	Если ИДОтчета <> "РегламентированныйОтчетЕФС1ОСС" Тогда
		Возврат;
	КонецЕсли;

	ДополнитьПоказателемРаботающихВоВредныхУсловиях(ПараметрыОтчета, Контейнер);

КонецПроцедуры

// Вызывается при получении сведений о показателях отчета.
// Регистрирует показатель П000020000400.
//
// Параметры:
//  ПоказателиОтчета - Структура
//  ИДОтчета - Строка
//  ИДРедакцииОтчета - Строка
//  ПараметрыОтчета - Структура
//
Процедура ПриПолученииСведенийОПоказателяхОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета) Экспорт

	Если ИДОтчета <> "РегламентированныйОтчетЕФС1ОСС" Тогда
		Возврат;
	КонецЕсли;

	Если ИспользуетсяСпециальнаяОценкаУсловийТруда(ПараметрыОтчета) Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000020000400", Истина, Ложь);
	КонецЕсли;

КонецПроцедуры

// Обновляет флаг ВыявленыВредныеОпасныеФакторы в ТЧ Позиции документа-основания (ИзменениеШР, УтверждениеШР).
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - 
//  Должность - ОпределяемыйТип.УсловияТруда - 
//  ВредныеКлассы - Массив Из ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки - 
//
Процедура ОбновитьВыявленныеВредныеФакторыВДокументеОснования(ДокументСсылка, Должность, ВредныеКлассы) Экспорт
	КлассыУсловийТрудаВнутренний.ОбновитьВыявленныеВредныеФакторыВДокументеОснования(ДокументСсылка, Должность, ВредныеКлассы);
КонецПроцедуры

// Параметры:
//  ОбъектВладелец - ОпределяемыйТип.УсловияТруда -
//
// Возвращаемое значение:
//  Булево
//
Функция ВладелецНабораЗаписейЭтоУсловияТруда(ОбъектВладелец) Экспорт
	Возврат КлассыУсловийТрудаВнутренний.ВладелецНабораЗаписейЭтоУсловияТруда(ОбъектВладелец);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяСпециальнаяОценкаУсловийТруда(ПараметрыОтчета)

	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчета, "Организация");

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда") Тогда
		МодульОхранаТруда = ОбщегоНазначения.ОбщийМодуль("ОхранаТруда");
		Если МодульОхранаТруда.СпециальнаяОценкаУсловийТрудаИспользуется(Организация) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) Тогда
		Возврат ПолучитьФункциональнуюОпцию(
			"ПрименятьРезультатыСпециальнойОценкиУсловийТруда", Новый Структура("Организация", Организация));
	КонецЕсли;

	Возврат ПолучитьФункциональнуюОпцию("ПрименятьРезультатыСпециальнойОценкиУсловийТруда");

КонецФункции

Процедура ДополнитьПоказателемРаботающихВоВредныхУсловиях(ПараметрыОтчета, Контейнер)

	Если Не ИспользуетсяСпециальнаяОценкаУсловийТруда(ПараметрыОтчета) Тогда
		Возврат;
	КонецЕсли;

	Если Не Контейнер.Свойство("Раздел2") Тогда
		Возврат;
	КонецЕсли;

	ДатаОтчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчета, "ДатаКонцаПериодаОтчета");
	Если Не ЗначениеЗаполнено(ДатаОтчета) Тогда
		Возврат;
	КонецЕсли;

	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчета, "Организация");
	
	Контейнер.Раздел2.Строки[0].Данные.П000020000400 = РассчитатьКоличествоРаботающихВоВредныхУсловиях(ДатаОтчета, Организация);

	ПоместитьВоВременноеХранилище(Новый Структура("Контейнер", Контейнер), ПараметрыОтчета.АдресВоВременномХранилище);

КонецПроцедуры

Функция РассчитатьКоличествоРаботающихВоВредныхУсловиях(ДатаОтчета, Организация)

	УстановитьПривилегированныйРежим(Истина);

	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Организация;
	ПараметрыПолучения.ОкончаниеПериода = ДатаОтчета;

	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПолучения.Отборы, "ВидЗанятости", "=", Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);

	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Истина, ПараметрыПолучения);

	ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВТ, "ВТСотрудникиОрганизации");

	КадровыеДанные = "ДатаУвольнения,КлассУсловийТруда,ВыявленыВредныеОпасныеФакторы";

	ЕстьГосударственнаяСлужба = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба");
	Если ЕстьГосударственнаяСлужба Тогда
		КадровыеДанные = КадровыеДанные + ",ВидДолжностиГосударственнойСлужбы";
	КонецЕсли;

	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВТ, Истина, КадровыеДанные);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ВредныеКлассы", КлассыУсловийТрудаКлиентСервер.ВредныеИОпасныеКлассыУсловийТруда());
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаОтчета);

	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|		КОГДА КадровыеДанные.КлассУсловийТруда В (&ВредныеКлассы)
		|			ТОГДА 1
		|		КОГДА КадровыеДанные.ВыявленыВредныеОпасныеФакторы = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Количество
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
		|ГДЕ
		|	(КадровыеДанные.ДатаУвольнения >= &ДатаАктуальности
		|		ИЛИ КадровыеДанные.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))";
		
	Если ЕстьГосударственнаяСлужба Тогда
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		МодульГосударственнаяСлужба.ИсключитьВоенныеДолжностиВЗапросе(Запрос, "КадровыеДанные.ВидДолжностиГосударственнойСлужбы");
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;

	Возврат РезультатЗапроса.Выгрузить()[0].Количество;

КонецФункции

#КонецОбласти
